read_verilog -sv /home/zhigang/DATA/raw_designs/vtr_designs/verilog/koios/bnn.v;
hierarchy -auto-top;
proc; 
opt;
tee -o /home/zhigang/DATA/raw_designs/vtr_designs/verilog/koios/bnn.v.out stat;
