read_verilog -sv /home/zhigang/DATA/raw_designs/vtr_designs/verilog/ch_intrinsics_submodules/memory_controller.v;
hierarchy -auto-top;
proc; 
opt;
tee -o /home/zhigang/DATA/raw_designs/vtr_designs/verilog/ch_intrinsics_submodules/memory_controller.v.out stat;
