read_verilog -sv /home/zhigang/DATA/raw_designs/vtr_designs/verilog/koios/clstm_like.small.v;
hierarchy -auto-top;
proc; 
opt;
tee -o /home/zhigang/DATA/raw_designs/vtr_designs/verilog/koios/clstm_like.small.v.out stat;
