read_verilog -sv /home/zhigang/DATA/raw_designs/vtr_designs/verilog/stereovision0_submodules/find_max.v;
hierarchy -auto-top;
proc; 
opt;
tee -o /home/zhigang/DATA/raw_designs/vtr_designs/verilog/stereovision0_submodules/find_max.v.out stat;
