read_verilog -sv [DESIGN];
hierarchy -auto-top;
proc; 
opt;
tee -o [OUTPUT] stat;
