read_verilog -sv /home/zhigang/raw_data/designs_width/test_designs/comb_adder/comb_adder_32.v;
hierarchy -auto-top;
proc; 
opt;
tee -o /home/zhigang/raw_data/designs_width/test_designs/comb_adder/comb_adder_32.v.out stat -width;
