read_verilog -sv /home/zhigang/raw_data/designs_width/vtr_designs/verilog/ch_intrinsics_submodules/memory_controller.v;
hierarchy -auto-top;
proc; 
opt;
tee -o /home/zhigang/raw_data/designs_width/vtr_designs/verilog/ch_intrinsics_submodules/memory_controller.v.out stat -width;
